papers/proc-ieee-12-smartgrid.html
---
layout: page
title: Cyber-Physical Security of a Smart Grid Infrastructure
---
<hr />

<p>
<b>Yilin Mo, Tiffany Hyun-Jin Kim, Kenneth Brancik, Dona Dickinson, Heejo Lee, Adrian Perrig and Bruno Sinopoli</b>
</p>

<p>
<i>Proceedings of the IEEE, Special Issue on Cyber-Physical Systems</i>, Jan 2012, Volume 100, Issue 1, Pages 195-209
</p>

<div id="outline-container-orgf69deff" class="outline-2">
<h2 id="orgf69deff">Abstract</h2>
<div class="outline-text-2" id="text-orgf69deff">
<p>
It is often appealing to assume that existing solutions can be directly applied to emerging engineering domains. Unfortunately, careful investigation of the unique challenges presented by new domains exposes its idiosyncrasies, thus often requiring new approaches and solutions. In this paper, we argue that the smart grid, replacing its incredibly successful and reliable predecessor, poses a series of new security challenges, among others, that require novel approaches to the field of cyber security. We will call this new field cyber-physical security. The tight coupling between information and communication technologies and physical systems introduces new security concerns, requiring a rethinking of the commonly used objectives and methods. Existing security approaches are either inapplicable, not viable, insufficiently scalable, incompatible, or simply inadequate to address the challenges posed by highly complex environments such as the smart grid. A concerted effort by the entire industry, the research community, and the policy makers is required to achieve the vision of a secure smart grid infrastructure.
</p>
</div>
</div>
